Hi @justinretzolk sure! Thank you.

Here's the information you need. Please tell me if you need more.

Here's my configuration:
```hcl
resource "aws_apigatewayv2_api" "example" {
  name = "example"
  protocol_type = "HTTP"
  body = file("apigw_v2.yaml")
}
```

And here's the content of `apigw_v2.yaml`:
```yaml
openapi: "3.0.1"
```

And here's the output from the `terraform apply` command:

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_api.example will be created
  + resource "aws_apigatewayv2_api" "example" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + body                         = "openapi: \"3.0.1\""
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "example"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "myTag01" = "value01"
          + "myTag02"   = "value02"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_apigatewayv2_api.example: Creating...
aws_apigatewayv2_api.example: Creation complete after 4s [id=XXXXXXXXXX]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

If necessary, I'm giving you the (simplified version of) my `terraform.tfstate`:

```json
{
  "version": 4,
  "terraform_version": "1.9.2",
  "serial": 1,
  "lineage": "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX",
  "outputs": {},
  "resources": [
    {
      "mode": "managed",
      "type": "aws_apigatewayv2_api",
      "name": "example",
      "provider": "provider[\"registry.terraform.io/hashicorp/aws\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "api_endpoint": "https://XXXXXXXXXX.execute-api.XXX.amazonaws.com",
            "api_key_selection_expression": "$request.header.x-api-key",
            "arn": "arn:aws:apigateway:XXX::/apis/XXXXXXXXXX",
            "body": "openapi: \"3.0.1\"",
            "cors_configuration": [],
            "credentials_arn": null,
            "description": "",
            "disable_execute_api_endpoint": false,
            "execution_arn": "arn:aws:execute-api:XXX:000000000000:XXXXXXXXXX",
            "fail_on_warnings": null,
            "id": "XXXXXXXXXX",
            "name": "Imported on 2024-12-13T09:04:05Z",
            "protocol_type": "HTTP",
            "route_key": null,
            "route_selection_expression": "$request.method $request.path",
            "tags": null,
            "tags_all": {},
            "target": null,
            "version": ""
          },
          "sensitive_attributes": [],
          "private": "XXX"
        }
      ]
    }
  ]
}

```

As reported, after this first and only `terraform apply`, the name of my resource on AWS console is:
`Imported on 2024-12-13T09:04:05Z` as you can see on the `terraform.tfstate`.

Thanks!